-----------------------------------------------------------------------------------------
--
-- main.lua
-- 本範例說明如何使用ActivityIndicator來顯示App正在Loading或是運行的狀態。需要特別注意的是native物件
-- 所生成的元件無法被加入Group當中，而且永遠呈現在一般的視覺元件之上，像是Group.Image.Text等
-- Author: Zack Lin
-- Time: 2015/4/16
--
-----------------------------------------------------------------------------------------

--=======================================================================================
--引入各種函式庫
--=======================================================================================
display.setStatusBar( display.HiddenStatusBar )

--=======================================================================================
--宣告各種變數
--=======================================================================================
_SCREEN = {
	WIDTH = display.viewableContentWidth,
	HEIGHT = display.viewableContentHeight
}
_SCREEN.CENTER = {
	X = display.contentCenterX,
	Y = display.contentCenterY
}


local initial
local hideActivityIndicator
--=======================================================================================
--宣告與定義main()函式
--=======================================================================================
local main = function (  )
	initial()
end
--=======================================================================================
--定義其他函式
--=======================================================================================
initial = function (  )
	--顯示ActivityIndicator
	native.setActivityIndicator( true )
	timer.performWithDelay( 5000, hideActivityIndicator)
end

hideActivityIndicator = function (  )
	--隱藏ActivityIndicator
	native.setActivityIndicator( false )
end
--=======================================================================================
--呼叫主函式
--=======================================================================================
main()